china-djyos/djyos/djysdk/djysrc/bsp/cpudrv/stm32f3xx/src/cpu_peri_iic.c
//----------------------------------------------------
// Copyright (c) 2014, SHENZHEN PENGRUI SOFT CO LTD. All rights reserved.
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions are met:

// 1. Redistributions of source code must retain the above copyright notice,
//    this list of conditions and the following disclaimer.
// 2. Redistributions in binary form must reproduce the above copyright notice,
//    this list of conditions and the following disclaimer in the documentation
//    and/or other materials provided with the distribution.

// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
// AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
// IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
// ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
// LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
// CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
// SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
// INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
// CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
// ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
// POSSIBILITY OF SUCH DAMAGE.
//-----------------------------------------------------------------------------
// Copyright (c) 2014 著作权由深圳鹏瑞软件有限公司所有。著作权人保留一切权利。
//
// 这份授权条款，在使用者符合下列条件的情形下，授予使用者使用及再散播本
// 软件包装原始码及二进位可执行形式的权利，无论此包装是否经改作皆然：
//
// 1. 对于本软件源代码的再散播，必须保留上述的版权宣告、本条件列表，以
//    及下述的免责声明。
// 2. 对于本套件二进位可执行形式的再散播，必须连带以文件以及／或者其他附
//    于散播包装中的媒介方式，重制上述之版权宣告、本条件列表，以及下述
//    的免责声明。

// 免责声明：本软件是本软件版权持有人以及贡献者以现状（"as is"）提供，
// 本软件包装不负任何明示或默示之担保责任，包括但不限于就适售性以及特定目
// 的的适用性为默示性担保。版权持有人及本软件之贡献者，无论任何条件、
// 无论成因或任何责任主义、无论此责任为因合约关系、无过失责任主义或因非违
// 约之侵权（包括过失或其他原因等）而起，对于任何因使用本软件包装所产生的
// 任何直接性、间接性、偶发性、特殊性、惩罚性或任何结果的损害（包括但不限
// 于替代商品或劳务之购用、使用损失、资料损失、利益损失、业务中断等等），
// 不负任何责任，即在该种使用已获事前告知可能会造成此类损害的情形下亦然。
//-----------------------------------------------------------------------------
// =============================================================================
// Copyright (C) 2012-2020 长园继保自动化有限公司 All Rights Reserved
// 文件名     ：cpu_peri_iic.c
// 模块描述: IIC模块底层硬件驱动，寄存器级别的操作
// 创建时间: 17/09.2014
// =============================================================================
#include "cpu_peri.h"
#include "djyos.h"
#include "stdint.h"
#include "../../../arch/arm/arm32_stdint.h"
#include "stdio.h"
#include "iicbus.h"
#include "endian.h"
#include "lock.h"
#include "int.h"
#include "stm32f3xx_hal_conf.h"
#include "cpu_peri_iic.h"
#include "stm32f303xc.h"
// =============================================================================
static I2C_TypeDef volatile * const tg_I2c_Reg[] = { I2C1,
                                                     I2C2};

#define tagI2CReg  I2C_TypeDef
static struct IIC_CB s_IIC_CB[CN_IIC_NUM];
//static struct IIC_CB s_IIC_CB[CN_IIC2];


static u32 IIC_BUF_LEN[CN_IIC_NUM]={128,128};
//iic缓冲区定数组
static u8 s_IIC1Buf[128];
static u8 s_IIC2Buf[128];


static u8* s_IICBuf[CN_IIC_NUM]={s_IIC1Buf,
                                 s_IIC2Buf};

struct IIC_IntParamSet
{
    struct SemaphoreLCB *pDrvPostSemp;   //信号量
    u32 TransCount;                      //传输数据量计数器
    u32 TransTotalLen;                   //接收的数据总量
};

static struct IIC_IntParamSet IntParamset[CN_IIC_NUM];

const char *IIC_Name[CN_IIC_NUM]=
         {"IIC1","IIC2"};


// =============================================================================
// 功能：IIC检查是否有错误
// 参数： reg iic基地址
// 返回：true/false
// =============================================================================
static bool_t  _IIC_Chek(tagI2CReg *reg)
{
    if (reg->ISR & (I2C_ISR_NACKF))       /*如果仲裁丢失*/
        {
            #ifdef DEBUG
            printk("__i2c_wait: nackf\n");
            #endif
            return false;
        }
    return true;
}


// =============================================================================
// 功能: 使能iic中断,接收与发送共用一个中断源。
// 参数: reg,被操作的寄存器组指针
// 返回: 无
// =============================================================================
static void __IIC_IntEnable(tagI2CReg *reg)
{
    reg->CR1 |= (I2C_CR1_TXIE|I2C_CR1_RXIE);//发送和接收中断同时使能

}

// =============================================================================
// 功能: 禁止iic中断,接收与发送共用一个中断源。
// 参数: reg,被操作的寄存器组指针
// 返回: 无
// =============================================================================
static void __IIC_IntDisable(tagI2CReg *reg)  //OK
{
    reg->CR1 &= ~(I2C_CR1_RXIE| I2C_CR1_TXIE);
}


// =============================================================================
// 功能: 选择设置时钟
// 参数: iic_port iic编号，
//        sel:选择时钟                 //F7：bit:0- APB1-54MHz    1-sysclk-216MHz   2- HSI-8MHz
                         //F3：bit:0- HSI-8MHz      1-sysclk-72MHz
//        TIMINGR 寄存器设置 (4<<28)|(9<<20)|(1<<16)|(39<<8)|(50);
//        初始值:0x40912732;
// 返回: 无
// =============================================================================

static bool_t __IIC_ClkSet(u8 iic_port,u8 sel,u32 TIMINGR)
{
    if(iic_port>=CN_IIC_NUM)
        return false;

    RCC->CFGR3 |=(sel<<(iic_port+4));  //配置I2C时钟源，sel=0为HSI CLOCK
                                       //           sel=1为SYSCLK CLOCK
    tg_I2c_Reg[iic_port]->CR1 &=~(1);
    tg_I2c_Reg[iic_port]->TIMINGR=TIMINGR;   //TIMINGR为时序寄存器，对I2C时序进行配置
    return true;
}


// =============================================================================
// 功能: I/O模拟的方式 释放没有复位和使能引脚的IIC器件
// 参数: port I/O口 如 CN_GPIO_B
//      TS_SDA:引脚号
//      TS_SCK:引脚号
// 返回: true/false
// =============================================================================
bool_t IIC_Busfree(u32 port,u32 sda_pin,u32 sck_pin)
{
     u32 timeout=0;
     GPIO_PowerOn(port);
     GPIO_CfgPinFunc(port,sda_pin,GPIO_MODE_IN,   //TS_SDA
                     GPIO_OTYPE_OD,GPIO_SPEED_VH,GPIO_PUPD_PU);
     GPIO_CfgPinFunc(port,sck_pin,GPIO_MODE_OUT,  //TS_SCK
                     GPIO_OTYPE_OD,GPIO_SPEED_VH,GPIO_PUPD_PU);
     while(1)
     {
          timeout++;
          GPIO_SettoLow(port,sck_pin);
          Djy_DelayUs(10);

          GPIO_SettoHigh(port,sck_pin);
          Djy_DelayUs(10);

          if(timeout>=CONFIG_I2C_TIMEOUT)
              return false;
          if( GPIO_GetData(port)&(sda_pin))
              break;
    }
     GPIO_CfgPinFunc(port,sda_pin,GPIO_MODE_OUT,  //TS_SCK
                         GPIO_OTYPE_OD,GPIO_SPEED_VH,GPIO_PUPD_PU);
    //产生停止信号 iic总线释放
    GPIO_SettoLow(port,sda_pin);
    Djy_DelayUs(10);
    GPIO_SettoHigh(port,sda_pin);
    Djy_DelayUs(10);

