china-djyos/djyos/djysdk/djysrc/bsp/cpudrv/stm32f3xx/src/cpu_peri_iic.c
    return true;
}

// =============================================================================
// 功能: 硬件GPIO初始化，包括时钟选择和iic初始化参数
// 参数: IIC_NO,编号
// 返回: true/false
// =============================================================================
static bool_t __IIC_GpioConfig(u8 iic_port)
{

    RCC->APB1ENR|=(1<<(21+iic_port));  //iic时钟使能


    if(__IIC_ClkSet(iic_port,1,0x40912732)==false)  //默认时钟源为CLOCK时钟
        return false;

    tg_I2c_Reg[iic_port]->CR1 &=~I2C_CR1_PE;        //PE使能
    tg_I2c_Reg[iic_port]->CR1 &=~I2C_CR1_ANFOFF;    //时钟50ns以下时需要写1禁止模拟滤波器减小抑制
    tg_I2c_Reg[iic_port]->CR1 |=I2C_CR1_DNF_4BIT(0);//可滤除的噪声尖峰脉宽 0~15 t I2CCLK
    tg_I2c_Reg[iic_port]->CR1 &=~I2C_CR1_NOSTRETCH; //
    tg_I2c_Reg[iic_port]->CR2 |=I2C_CR2_AUTOEND;    //自动结束模式
    tg_I2c_Reg[iic_port]->CR2 &=~I2C_CR2_ADD10;     //7位寻址模式
    tg_I2c_Reg[iic_port]->OAR1=0x8000;              //使能设备自身地址
    tg_I2c_Reg[iic_port]->CR1  = I2C_CR1_PE;        //PE使能

    return true;

}
// RELOAD CR2_24 位置 1。在该模式下，完成 NBYTES
//中所编程字节数的数据传输之后，TCR 标志将置 1，并且 TCIE 置 1 时将生成中断。只要
//TCR 标志置 1，SCL 便会延长。当往 NBYTES 写入一个非零值时，TCR 由软件清零。
//在往 NBYTE 中设置最后一次传输的字节数前，必须把 RELOAD 位清零
// =============================================================================
// 功能: IIC中断配置函数
// 参数: IntLine,中断线
//       isr,中断服务函数指针
// 返回: 无
// =============================================================================
static void __IIC_IntConfig(u8 iic_port,u32 (*isr)(ptu32_t))
{
        ufast_t IntLine;
        switch (iic_port)
        {
        case CN_IIC1:
            IntLine=CN_INT_LINE_I2C1_EV;
            break;
        case CN_IIC2:
            IntLine=CN_INT_LINE_I2C2_EV;
            break;
            default:return;
        }
        Int_Register(IntLine);
        Int_IsrConnect(IntLine,isr);
        Int_SettoAsynSignal(IntLine);
        Int_ClearLine(IntLine);   //清掉初始化产生的发送fifo空的中断
        Int_RestoreAsynLine(IntLine);
}

// =============================================================================
// 功能: 产生停止时序，结束本次与外器件之间的通信
// 参数: reg,iic外设寄存器基址
// 返回: 无
// =============================================================================
static void __IIC_GenerateStop(tagI2CReg *reg)
{
    reg->CR2 |=I2C_CR2_STOP;//产生停止位

}

// =============================================================================
// 功能：IIC写
// 参数： reg,寄存器基址
//     devaddr,器件物理地址，最后一bit区分读写
//     buf_addr地址写缓冲
//     len_addr 地址长度
//     buf写缓冲
//     len 长度
// 返回：true/false
// =============================================================================
static bool_t __IIC_Write(tagI2CReg *reg,u8 devaddr, u8 *adder_nuf, u32 addr_len,u8 *buf, u32 len)
{
    u32 timeout=0;
    u32 i=0;
    reg->CR2 &=~I2C_CR2_SADD_10BIT(0x7f<<1);
    reg->CR2 |=I2C_CR2_SADD_10BIT(devaddr<<1);//从器件地址
    reg->CR2 &=~I2C_CR2_RD_WRN;//写控制
     if(reg->ISR|=I2C_ISR_STOPF)
            reg->ICR|=I2C_ICR_STOPCF;
     if(reg->ISR|=I2C_ISR_NACKF)
            reg->ICR|=I2C_ICR_NACKCF;
     len=len+addr_len;
    if(len>255)
    {
        reg->CR2 |=I2C_CR2_RELOAD;//传输字节大于255
        reg->CR2 |=I2C_CR2_NBYTES_8BIT(0xFF);
        reg->CR2 |=I2C_CR2_AUTOEND;//自动结束方式
        reg->CR2 |=I2C_CR2_START;//start

        while(timeout<CONFIG_I2C_MBB_TIMEOUT)
        {

            if((reg->ISR&I2C_ISR_TXE)&&(reg->ISR&I2C_ISR_TXIS)\
                      &&(!(reg->ISR&I2C_ISR_NACKF)))  //传输字节
            {
                if(i<addr_len)
                    *((volatile u8 *)&reg->TXDR)=adder_nuf[i];
                else
                    *((volatile u8 *)&reg->TXDR)=buf[i-addr_len];
                i++;
            }
            else//判断出错或者超时
            {
                if(_IIC_Chek(reg)==false)
                    return false;
                timeout++;
                Djy_DelayUs(10);
            }

            if(reg->ISR&I2C_ISR_TCR)//255字节传输完成
            {
                len-=255;
                if(len>255)
                {
                    reg->CR2 |=I2C_CR2_NBYTES_8BIT(0xFF);
                    reg->CR2 |=I2C_CR2_RELOAD;//传输字节大于255
                }
                else
                {
                    reg->CR2 &=~I2C_CR2_NBYTES_8BIT(0xff);//清零
                    reg->CR2 |=I2C_CR2_NBYTES_8BIT(len);
                    reg->CR2 &=~I2C_CR2_RELOAD;//传输字节

                }
            }
            //传输是结束
            if((reg->ISR&I2C_ISR_TC)||(reg->ISR&I2C_ISR_STOPF))//传输完成
            {
                __IIC_GenerateStop(reg);
                return true;
            }
        }
        return false;

    }
    //写字节小于255字节
    else
    {
        reg->CR2 &=~I2C_CR2_RELOAD;//小于255字节
        reg->CR2 &=~I2C_CR2_NBYTES_8BIT(0xff);//清零
        reg->CR2 |=I2C_CR2_NBYTES_8BIT(len);
        reg->CR2 |=I2C_CR2_AUTOEND;//自动结束方式
        reg->CR2 |=I2C_CR2_START;//start
        while(timeout<CONFIG_I2C_MBB_TIMEOUT)
        {

            if((reg->ISR&I2C_ISR_TXE)&&(reg->ISR&I2C_ISR_TXIS)\
                  &&(!(reg->ISR&I2C_ISR_NACKF)))//传输字节
            {

                if(i<addr_len)
                     reg->TXDR = adder_nuf[i];
                else
                    reg->TXDR= buf[i-addr_len];
                i++;
            }

            else//判断出错或者超时
            {
                if(_IIC_Chek(reg)==false)
                    return false;
                timeout++;
                Djy_DelayUs(10);
            }
            //判断是否传输完成
            if((reg->ISR&I2C_ISR_TC)||(reg->ISR&I2C_ISR_STOPF)) //传输完成
            {
                if(reg->ISR|I2C_ISR_STOPF)
                    return true;
                if(_IIC_Chek(reg)==false)
                    return false;
                return true;
            }
        }
        return false;
    }
}
// =============================================================================
// 功能：IIC写地址
// 参数： reg,寄存器基址
//     devaddr,器件物理地址，最后一bit区分读写
//     mem_addr写缓冲
//     maddrlen 长度
//     Start_falg发送起始停止标着为
// 返回：true/false
// =============================================================================
static bool_t __IIC_WriteAddr(tagI2CReg *reg,u8 devaddr, u8 *mem_addr, u32 maddrlen)
{
    u32 timeout=0;
    u32 i=0;
    reg->CR2 &=~I2C_CR2_SADD_10BIT(0x7f<<1);
    reg->CR2 |=I2C_CR2_SADD_10BIT(devaddr<<1);//从器件地址
    reg->CR2 &=~I2C_CR2_RD_WRN;//写控制
     if(reg->ISR|=I2C_ISR_STOPF)
            reg->ICR|=I2C_ICR_STOPCF;
     if(reg->ISR|=I2C_ISR_NACKF)
            reg->ICR|=I2C_ICR_NACKCF;

