china-djyos/djyos/djysdk/djysrc/bsp/cpudrv/stm32f3xx/src/cpu_peri_iic.c
// =============================================================================
// 功能: 启动写时序，启动写时序的过程为：器件地址（写）、存储地址（写），当存储地址完
//       成时，需打开中断，之后将会发生发送中断，在中断服务
//       函数中，每次发送一定的字节数，直到len数据量，post信号量iic_bus_semp，并产生
//       停止时序
// 参数: SpecificFlag,个性标记，本模块内即IIC寄存器基址
//      DevAddr,器件地址的前7比特，已将内部地址所占的bit位更新，该函数需将该地址左
//               移一位增加增加最后一位读/写比特;
//      MemAddr,存储器内部地址，即发送到总线上的地址，该地址未包含放在器件地址上的
//               比特位；
//      MenAddrLen,存储器内部地址的长度，字节单位，未包含在器件地址里面的比特位；
//      Length,接收的数据总量，接收数据的倒数第一字节，即count-1，停止产生ACK信号，
//          当接收的字节数为count时，产生停止时序，并释放信号量iic_semp;
//      IIC_BusSemp,发送完成时驱动需释放的信号量。发送程序读IIC_PortRead时，若读不到数
//          则需释放该信号量，产生结束时序
// 返回: TRUE，启动读时序成功，FALSE失败
// =============================================================================
static bool_t __IIC_GenerateWriteStart(tagI2CReg *reg,
                                       u8 dev_addr,
                                       u32 mem_addr,
                                       u8 maddr_len,
                                       u32 length,
                                       struct SemaphoreLCB *iic_semp)
{
    u8 mem_addr_buf[4];   //？？mem_addr_buf[4]是否需要改为mem_addr_buf[3]？？？？？？？
    u8 iic_port;
    //通过specific_flag区分是哪条总线
    if(reg==tg_I2c_Reg[CN_IIC1])
        iic_port=CN_IIC1;
    else if (reg==tg_I2c_Reg[CN_IIC2])
        iic_port=CN_IIC2;
    else
        return false;

    IntParamset[iic_port].TransTotalLen = length;
    IntParamset[iic_port].TransCount = 0;
    IntParamset[iic_port].pDrvPostSemp = iic_semp;  //iic_bus_semp

    //将地址作大小端变换

    u8 i;
    for(i=0;i<maddr_len;i++)
    {
        mem_addr_buf[(maddr_len-1)-i]=((mem_addr>>(8*i))&0xff);
    }
    __IIC_IntDisable(reg);     //关中断
    //先发送器件地址，内部地址，然后发送第一个数据
    if(__IIC_WriteAddr(reg, dev_addr, mem_addr_buf,maddr_len) )
    {
        reg->CR2 &=~I2C_CR2_RD_WRN;//写标志
        reg->CR2 |=I2C_CR2_RELOAD;//传输字节大于255
        reg->CR2 |=I2C_CR2_NBYTES_8BIT(0xFF);
        reg->CR2 |=I2C_CR2_AUTOEND;//自动结束方式
        __IIC_IntEnable(reg);//使能中断
        reg->CR2 |=I2C_CR2_START;//start
        return true;
    }

    return false;
}

// =============================================================================
// 功能: 启动读时序，启动读时序的过程为：器件地址（写）、存储地址（写）、器件地址（读）
//       当器件地址（读）完成时，需打开中断，重新配置寄存器为接收模式，之后将会发生
//       接收数据中断，在中断中将接收到的数据调用IIC_PortWrite写入缓冲，接收到len字
//       节数的数据后，释放信号量iic_semp
// 参数: SpecificFlag,个性标记，本模块内即IIC寄存器基址
//      DevAddr,器件地址的前7比特，已将内部地址所占的bit位更新，该函数需将该地址左
//               移一位增加增加最后一位读/写比特;
//     MemAddr,存储器内部地址，即发送到总线上的地址，该地址未包含放在器件地址上的
//               比特位；
//      MenAddrLen,存储器内部地址的长度，字节单位，未包含在器件地址里面的比特位；
//      Length,接收的数据总量，接收数据的倒数第一字节，即count-1，停止产生ACK信号，当接
//             收的字节数为count时，产生停止时序，并释放信号量iic_semp;
//     IIC_BusSemp,读完成时，驱动需释放的信号量（缓冲区信号量）
// 返回: TRUE，启动读时序成功，FALSE失败
// =============================================================================
static bool_t __IIC_GenerateReadStart( tagI2CReg *reg,
                                       u8 dev_addr,
                                       u32 mem_addr,
                                       u8 maddr_len,
                                       u32 length,
                                       struct SemaphoreLCB *iic_semp)
{
    u8 mem_addr_buf[4];
    u8 iic_port;
    if(reg==tg_I2c_Reg[CN_IIC1])
        iic_port=CN_IIC1;
    else if(reg==tg_I2c_Reg[CN_IIC2])
        iic_port=CN_IIC2;
    else
        return false;

    IntParamset[iic_port].TransTotalLen = length;
    IntParamset[iic_port].TransCount = 0;
    IntParamset[iic_port].pDrvPostSemp = iic_semp;  //iic_buf_semp

    u8 i;
    for(i=0;i<maddr_len;i++)
    {
        mem_addr_buf[(maddr_len-1)-i]=((mem_addr>>(8*i))&0xff);
    }
    __IIC_IntDisable(reg);//关中断

    //写器件地址和寻址地址
    //写器件地址和寻址地址
    if(__IIC_WriteAddr(reg, dev_addr, mem_addr_buf,maddr_len) )
    {
        reg->CR2 |=I2C_CR2_AUTOEND;//自动结束方式
        reg->CR2 |=I2C_CR2_RD_WRN;//读标志
        __IIC_IntEnable(reg);//使能中断
        reg->CR2 |=I2C_CR2_START;//start
        return true;
    }
    return false;
}

// =============================================================================
// 功能: 结束本次读写回调函数，区分读写的不同停止时序，当属于发送时，则直接停止时序，
//      若为读，则先停止回复ACK，再停止
// 参数: reg,个性标记，本模块内即IIC寄存器基址
// 返回: 无
// =============================================================================
static void __IIC_GenerateEnd(tagI2CReg *reg)
{
    if(reg == NULL)
        return;
    if(reg->CR2 & I2C_CR2_RD_WRN )//发送
    {
        reg->CR1 |= I2C_CR2_NACK;//停止回复ACK
        __IIC_GenerateStop(reg);
    }
    else //接收
    {
        __IIC_GenerateStop(reg);
    }
}

//==============================================================================
// 功能：IIC总线控制回调函数，被上层调用，目前只实现对IIC时钟频率配置
// 参数：TIMINGR-->位 31:28 PRESC时序预分频因子
//               位 23:20 SCLDEL[3:0]：数据建立时间
//               位 19:16 SDADEL[3:0]：数据保持时间
//               位 15:8  SCLH[7:0]：SCL 高电平周期
//               位 7:0   SCLL[7:0]：SCL 低电平周期
//      reg  本模块内即IIC寄存器基址
// 返回：无
//==============================================================================
static void _IIC_ClkSet(tagI2CReg *reg,u32 data)
{
    u32 SCLH,SCLL;
    reg->CR1 &=~I2C_CR1_PE;
    SCLH=(CN_CFG_MCLK)/(data*2);
    SCLL=SCLH;
    reg->TIMINGR&=~((I2C_TIMINGE_SCLH_8BIT(0xff)|I2C_TIMINGE_SCLL_8BIT(0xff)));
    reg->TIMINGR|=(I2C_TIMINGE_SCLH_8BIT(SCLH)|I2C_TIMINGE_SCLL_8BIT(SCLL));
    reg->CR1 |=I2C_CR1_PE;//PE使能
}

// =============================================================================
// 功能：IIC总线控制回调函数，被上层调用，目前只实现对IIC时钟频率配置
// 参数：reg,个性标记，本模块内即IIC寄存器基址
//     cmd,命令
//     data1,data2,数据，与具体命令相关
// 返回：无
// =============================================================================
static s32 __IIC_BusCtrl(tagI2CReg *reg,u32 cmd,u32 data1,u32 data2)
{
    if( reg == NULL )
        return 0;
    switch(cmd)
    {
        case CN_IIC_SET_CLK: //设置时钟频率
                _IIC_ClkSet(reg,data1);
              break;
        case CN_IIC_DMA_USED://使用dma传输

            break;
        case CN_IIC_DMA_UNUSED://禁止dma传输

            break;
        case CN_IIC_SET_POLL:  //使用轮询方式发送接收
            __IIC_IntDisable(reg);
            break;
        default:
            return 0;
    }
    return 1;
}

