china-djyos/djyos/djysdk/djysrc/bsp/cpudrv/stm32f3xx/src/cpu_peri_iic.c
// =============================================================================
// 功能：      IIC接收与发送中断服务函数。该函数实现的功能如下：
//       1.每发送与接收一个或若干字节发生一次中断；
//       2.若有多个中断使用同一个中断号，则需根据具体情况区分使用的是哪个中断；
//       3.清中断标志，并判断ACK信号，每读写字节，计数器都需相应修改；
//       4.接收达到倒数第一个字节时，需配置不发送ACK信号；
//       5.接收或发送完成时，需post信号量IntParam->pDrvPostSemp；
//       6.接收或发送完成时，需产生停止时序。
// 参数：i2c_int_line,中断号，本函数没用到
// 返回：true falst
// =============================================================================
static u32 __IIC_ISR(ufast_t i2c_int_line)
{
    static struct IIC_CB *ICB;
    static struct IIC_IntParamSet *IntParam;
    tagI2CReg *reg;
    u8 iic_port;
    u8 ch;
    u32 IicErrorNo;
    switch (i2c_int_line)
    {
        case CN_INT_LINE_I2C1_EV:
            iic_port=CN_IIC1;
            break;
        case CN_INT_LINE_I2C2_EV:
            iic_port=CN_IIC2;
            break;
        default:    return false;
    }
    reg = (tagI2CReg*)tg_I2c_Reg[iic_port];
    ICB = &s_IIC_CB[iic_port];
    IntParam = &IntParamset[iic_port];

    //判断中断方式
    //清除中断
    //发送或者接受数据
    //出错检查
    if(reg->ISR & I2C_ISR_TXIS) //发送中断
    {
        if(IIC_PortRead(ICB,&ch,1) > 0)
        {
            *((volatile u8 *)&reg->TXDR) = ch;
            IntParam->TransCount ++;;
        }
        else if(IntParam->TransCount == IntParam->TransTotalLen)
        {
          Lock_SempPost(IntParam->pDrvPostSemp);
          __IIC_IntDisable(reg);//关中断
          __IIC_GenerateStop(reg);
        }
    }
    else if(reg->ISR & I2C_ISR_RXNE)//接收中断
    {
        while((IntParam->TransCount < IntParam->TransTotalLen))
        {
            // 最后一个字节master不发ACK，表示读操作终止
            if(IntParam->TransCount == IntParam->TransTotalLen - 1)
            {
                reg->CR2 |= I2C_CR2_NACK;
            }

            while (reg->ISR&I2C_ISR_RXNE)//传输字节
                ch = reg->RXDR;
            //写数据
            IIC_PortWrite(ICB,&ch,1);
            IntParam->TransCount ++;
        }
        if((IntParam->TransCount == IntParam->TransTotalLen)  &&
                                    (!(reg->ISR&I2C_ISR_RXNE)))//最后一位读取完成
        {
            __IIC_GenerateStop(reg);
            __IIC_IntDisable(reg);//关中断
            Lock_SempPost(IntParam->pDrvPostSemp);//释放总线信号量
        }

    }

    else//未启动通信
    {
        if(reg->ISR & (I2C_ISR_ARLO))//仲裁丢失中断
        {
            reg->ICR = I2C_ICR_ARLOCF;//清除仲裁丢失中断标志位
            IicErrorNo = CN_IIC_POP_MAL_LOST_ERR;
            IIC_ErrPop(ICB,IicErrorNo);
        }
        if(reg->ISR & (I2C_ISR_NACKF))
        {
            reg->ICR = I2C_ICR_ARLOCF;//清除仲裁丢失中断标志位
            IicErrorNo = CN_IIC_POP_NO_ACK_ERR;
            IIC_ErrPop(ICB,IicErrorNo);
        }
    }

    return true;
}

// =============================================================================
// 功能：IIC底层驱动的初始化，完成整个IIC总线的初始化，其主要工作如下：
//       1.初始化总线控制块IIC_CB，回调函数和缓冲区的初始化赋值；
//       2.默认的硬件初始化，如GPIO或IIC寄存器等；
//       3.中断初始化，完成读写中断配置；
//       4.调用IICBusAdd或IICBusAdd_r增加总线结点；
// 参数：iic_port  IIC编号 CN_IIC1
//       Add_mode 寻址模式
// 返回：无
// =============================================================================
bool_t IIC_Init(u8 iic_port)
{

    struct IIC_Param IIC_Config[CN_IIC_NUM];

    IIC_Config[iic_port].BusName             = (char *)IIC_Name[iic_port];
    IIC_Config[iic_port].IICBuf              = (u8*)s_IICBuf[iic_port];
    IIC_Config[iic_port].IICBufLen           = IIC_BUF_LEN[iic_port];
    IIC_Config[iic_port].SpecificFlag        = (ptu32_t)tg_I2c_Reg[iic_port];
    IIC_Config[iic_port].pGenerateWriteStart = (WriteStartFunc)__IIC_GenerateWriteStart;
    IIC_Config[iic_port].pGenerateReadStart  = (ReadStartFunc)__IIC_GenerateReadStart;
    IIC_Config[iic_port].pGenerateEnd        = (GenerateEndFunc)__IIC_GenerateEnd;
    IIC_Config[iic_port].pBusCtrl            = (IICBusCtrlFunc)__IIC_BusCtrl;
    IIC_Config[iic_port].pWriteReadPoll      = (WriteReadPoll)__IIC_WriteReadPoll;

    __IIC_GpioConfig(iic_port);
    __IIC_IntConfig(iic_port,__IIC_ISR);

    if(NULL == IIC_BusAdd_s(&s_IIC_CB[iic_port],&IIC_Config[iic_port]))
        return 0;
    return 1;
}


